1C_Final/Documents/ОплатаУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ОплатаУслуг</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПлательщикиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Чек</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

1C_Final/Documents/ОплатаУслуг/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура КомандаОплатить(Команда)
	
		Если Объект.Ссылка.Пустая() Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Документ должен быть записан и проведен перед оплатой!";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	Если Объект.Услуги.Количество() = 0 Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "В документе нет заполненных услуг.";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;

	
	ИтоговаяСумма = Объект.Услуги.Итог("Сумма");
	Если ИтоговаяСумма = 0 Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Сумма по документу равна нулю. Проверьте заполнение цен и количества.";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Основание", Объект.Ссылка);
	
		ОповещениеОПослеОплаты = Новый ОписаниеОповещения("ПослеОплатыИПечати", ЭтотОбъект);
	
	ОткрытьФорму("Документ.ПоступлениеДенежныхСредств.ФормаОбъекта", ПараметрыФормы, ЭтаФорма, ОповещениеОПослеОплаты);
КонецПроцедуры

&НаКлиенте
Процедура ПослеОплатыИПечати(Результат, ДополнительныеПараметры) Экспорт 
	СсылкаНаПоступление = Результат.СсылкаНаОбъект;
	Если Не СсылкаНаПоступление.Пустая() Тогда
			ИмяКомандыПечати = "ПечатьЧека"; 
		
	
		КомандыПечати = ПолучитьКомандыПечатиПоступленияНаСервере(СсылкаНаПоступление);
		НужнаяКоманда = КомандыПечати.Найти(ИмяКомандыПечати);
		
		Если НужнаяКоманда <> Неопределено Тогда
		
		Иначе
			Сообщить("Печатная форма с именем """ + ИмяКомандыПечати + """ для документа поступления не найдена!", СтатусСообщения.Внимание);
		КонецЕсли;
		
	КонецЕсли;
	
	
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКомандыПечатиПоступленияНаСервере(СсылкаНаДокумент)
	
		Возврат Документы.ПоступлениеДенежныхСредств.ПолучитьКомандыПечати(СсылкаНаДокумент);
	
КонецФункции

&НаКлиенте
Процедура РассчитатьЦеныИСуммы(Команда)
	
	Если Объект.Услуги.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
		Состояние("Идет расчет цен и сумм...");
	      	МассивНаименований = Новый Массив;
		Для Каждого Строка Из Объект.Услуги Цикл
		Если Строка.Услуга <> Неопределено Тогда
			МассивНаименований.Добавить(Строка.Услуга.Наименование);
		КонецЕсли;
	КонецЦикла;
	
	Если МассивНаименований.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	
	СоответствиеТарифов = ПолучитьТарифыНаСервере(МассивНаименований);
	
	Для Каждого Строка Из Объект.Услуги Цикл
		Если Строка.Услуга = Неопределено Тогда
			Строка.ТарифЖКХ = Неопределено;
			Строка.Цена = 0;
		Иначе
			НаименованиеУслуги = Строка.Услуга.Наименование;
			ДанныеТарифа = СоответствиеТарифов.Получить(НаименованиеУслуги);
			
			Если ДанныеТарифа <> Неопределено Тогда
				Строка.ТарифЖКХ = ДанныеТарифа.Ссылка;
				Строка.Цена = ДанныеТарифа.Цена;
			Иначе
				Строка.ТарифЖКХ = Неопределено;
				Строка.Цена = 0;
			КонецЕсли;
		КонецЕсли;
		
			РассчитатьСуммуСтроки(Строка);
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТарифыНаСервере(МассивНаименованийУслуг)
	

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТарифыЖКХ.Наименование КАК НаименованиеУслуги,
		|	ТарифыЖКХ.Ссылка КАК Ссылка,
		|	ТарифыЖКХ.Цена КАК Цена
		|ИЗ
		|	Справочник.ТарифыЖКХ КАК ТарифыЖКХ
		|ГДЕ
		|	ТарифыЖКХ.Наименование В (&МассивНаименованийУслуг)
		|	И ТарифыЖКХ.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("МассивНаименованийУслуг", МассивНаименованийУслуг);
	
	РезультатЗапроса = Запрос.Выполнить();
	
		СоответствиеТарифов = Новый Соответствие;
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ДанныеТарифа = Новый Структура("Ссылка, Цена", Выборка.Ссылка, Выборка.Цена);
		СоответствиеТарифов.Вставить(Выборка.НаименованиеУслуги, ДанныеТарифа);
	КонецЦикла;
	
	Возврат СоответствиеТарифов;
	
КонецФункции

&НаКлиенте
Процедура РассчитатьСуммуСтроки(СтрокаТабличнойЧасти)
	
		Если СтрокаТабличнойЧасти.КоличествоЕдиниц = 0 Или СтрокаТабличнойЧасти.Цена = 0 Тогда
		СтрокаТабличнойЧасти.Сумма = 0;
	Иначе
		СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.КоличествоЕдиниц * СтрокаТабличнойЧасти.Цена;
	КонецЕсли;
	
КонецПроцедуры
